/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isprint.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: iyildiz <yildiz.ie58@gmail.com>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/07/06 15:30:51 by iyildiz           #+#    #+#             */
/*   Updated: 2023/07/28 19:13:57 by matrix           ###   ########.tr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

	/*
	 *  c değerinin yazdırılabilir olmasını kontrol eder.
	 */
int	ft_isprint(int c)
{
	if (c >= 32 && c <= 126)
	{
		return (1);
	}
	return (0);
}
